{"config": {"name": "model", "output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 784], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"kernel_constraint": null, "name": "dense", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "use_bias": true, "units": 256, "activity_regularizer": null, "dtype": "float32"}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout", "seed": null, "dtype": "float32", "rate": 0.050000000000000044}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "use_bias": true, "units": 256, "activity_regularizer": null, "dtype": "float32"}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "dtype": "float32", "rate": 0.050000000000000044}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "trainable": true, "use_bias": true, "units": 10, "activity_regularizer": null, "dtype": "float32"}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Model"}